export const faqString = String.raw`
  最后更新：2021-3-6
  更新内容：
    ·多目标产物计算/修改功能
    ·添加全局生产参数
    ·轨道采集器算法完善
    ·部分建筑能耗参考
    ·实验性副产物规避算法
    ·配方错误修正

  Q：如何使用？
  A：点击“添加产能”按钮，选择想要生产的物品，
  填写产量后点击“计算”即可查看结果。

  Q：想看建筑与耗电量统计！
  A：部分建筑，如采矿机和原油萃取站的需求数量
  因  为矿脉原因并不固定。所以相应建筑的耗电量
  统计也无法实现。将来会进一步完善。

  Q：同种产物有很多栏！
  A：这是因为启用了实验性副产物规避。目前还没
  有  实现单产物多配方计算，所以界面会有稍许混
  乱。预计这个问题会随着单产物多配方计算上线
  修复。

  Q：会保持更新吗？
  A：目前计算器的功能还比较欠缺，所以会保持高
  频率更新一段时间。可以关注我的bilibili账号来获
  得更多资讯。

  Q：目前有哪些计划中的功能？
  A：用电量统计、单产物多配方生产、UI优化、分
  拣器  数量需求参考、传送带带宽需求参考、副产
  物发电量统  计、总发电量发电设施需求参考。
`;
